using System.Diagnostics;
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

[assembly: AssemblyTitle("FView")]
[assembly: AssemblyFileVersion("1.0.0.1")]
[assembly: AssemblyCompany("大连弗莱德电气技术有限公司")]
[assembly: Guid("4c5e2e18-e8ab-4b1f-9963-e2b1de5db892")]
[assembly: AssemblyDescription("软件许可协议\r\n\r\n\r\n大连弗莱德电气技术有限公司 许可个人、公司或法律实体使用本软件，条件是您必须接受本许可协议的全部条款。请在使用本软件之前详细阅读有关条款和条件。本文件为您与许可方之间合法及可执行的合同。打开包装盒、撕掉签、点击“同意”或“是”键或者通过其它电子方式表示同意、或装载软件皆表示您同意本协议的条款和条件。若您不同意上述条款和条件，请点击“取消”键，并不再使用本软件。\r\n\r\n您可以：\r\nA. 使用大连弗莱德电气技术有限公司根据授权格式授予您使用的软件份数。但若该软件为大连弗莱德电气技术有限公司授权许可您使用的包含多个软件的套件的一部分，则您使用该系列软件中所有软件的总数不应超过授权格式所示的总数（以任何形式组合所得的结果计算）。您的授权格式为您有权复制软件的依据。若在本授权许可的同时、之前或之后，并不存在任何授权格式，则您可以在一部计算机上复制使用一份该软件；\r\nB.复制一份软件作为存档，或将软件复制到您计算机上的硬盘，保留原始软件作为存档；\r\nC. 在网络上使用本软件，但网络上的每一台计算机必须拥有使用该软件的授权，才能通过网络使用该软件；\r\nD. 按照您与 大连弗莱德电气技术有限公司之间的书面协议使用软件；\r\nE. 在获得大连弗莱德电气技术有限公司书面同意后，将该软件永久转让给其它个人或实体，但您不得保留该软件的任何备份，而且受让者亦必须书面同意本协议的各项条款。\r\n\r\n您不得：\r\nA.复制本软件随附的印刷文件；\r\nB.转让许可或出租本软件的任何部分；通过逆向工程、解译、分解、修改、翻译以及任何方法企图发现本软件的源代码，或藉本软件生产衍生产品；\r\nC. 将本软件作为设备管理、时分、服务提供商或服务部门布置的一部分使用；\r\nD.在您收到并安装替代软盘或代替旧版本的更新版本后，继续使用旧版本或其拷贝。在本软件被更新后，所有旧版本软件的拷贝应全部销毁；\r\nE.使用比本授权许可项下软件更新的版本，除非您已购买相应的维护和/或升级保险或通过其它方式单独取得使用新版本的权利；\r\nF. 若您取得的软件与大连弗莱德电气技术有限公司的其它产品一起包含于同一媒体，使用该媒体中您在授权格式中并无授权的大连弗莱德电气技术有限公司软件；\r\nG. 以本授权许可不允许的方式使用软件；")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyProduct("HMI 编辑环境")]
[assembly: AssemblyCopyright("Copyright © FLIGHT 2024")]
[assembly: AssemblyTrademark("")]
[assembly: ComVisible(false)]
[assembly: AssemblyVersion("1.0.0.1")]
